УТ_для_edt/src/Catalogs/CRM_РежимыРаботы/CRM_РежимыРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_РежимыРаботы</name>
  <attributes>
    <name>Круглосуточный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяСекунды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПериодыРаботы</name>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаСекунды</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончанияСекунды</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_РежимыРаботы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПериодыРаботы.Сортировать("ВремяНачала Возр, ВремяОкончания Возр");
	
	ВремяСекунды = 0;
	
	Для Каждого Период Из ПериодыРаботы Цикл
		Период.ВремяНачалаСекунды = Период.ВремяНачала - '0001-01-01';
		Период.ВремяОкончанияСекунды = Период.ВремяОкончания - '0001-01-01' ;
		ВремяСекунды = ВремяСекунды + (Период.ВремяОкончанияСекунды - Период.ВремяНачалаСекунды);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
